; domain
(define (domain elevators)
(:requirements :strips :typing :equality)

(:types 
    passenger
    elevator
    floor
    seat
)

(:predicates
    ; passenger
    (passenger_at ?p - passenger ?f - floor); passenger is at floor
    (inside ?p - passenger ?e - elevator); passenger is inside elevator

    ; elevator
    (elevator_at ?e - elevator ?f - floor); elevator is at floor
    (remaining_seats ?e - elevator ?s - seat); remaining seats in elevator
    (available_floor ?e - elevator ?f - floor); floor is available for elevator

    ; floor
    (move_up ?f - floor ?nf - floor); next floor of floor
    (move_down ?f - floor ?nf - floor); previous floor of floor

    ; seat
    (add_seat ?s - seat ?ns - seat); add seat to elevator
    (remove_seat ?s - seat ?ns - seat); remove seat from elevator
)


(:action get_in
    :parameters ( ?p - passenger ?e - elevator ?s - seat ?ns - seat ?f - floor)
    :precondition (and
        (remaining_seats ?e ?s) ; There is a seat available that can be removed
        (remove_seat ?s ?ns)
        (elevator_at ?e ?f) ; Passenger is at the same floor as the elevator
        (passenger_at ?p ?f)
        (available_floor ?e ?f)
    )
    :effect (and 
        (inside ?p ?e) ; Passenger is now inside
        (not (passenger_at ?p ?f)) ; Passenger is no longer at the floor
        (remaining_seats ?e ?ns) ; There is one less seat available
    )
)

(:action get_out
    :parameters (?p - passenger ?e - elevator ?s - seat ?ns - seat ?f - floor)
    :precondition (and 
        (inside ?p ?e) ; Passenger is inside elevator
        (add_seat ?s ?ns) ; There is a seat available that can be added
        (elevator_at ?e ?f)
        (available_floor ?e ?f) ; Passenger can get out at this floor
    )
    :effect (and
        (not (inside ?p ?e)) ; Passenger is no longer inside
        (passenger_at ?p ?f) ; Passenger is now at the floor
        (remaining_seats ?e ?ns) ; There is one more seat available
    )
)

(:action go_up
    :parameters (?e - elevator ?f - floor ?nf - floor)
    :precondition (and 
        (elevator_at ?e ?f) ; Elevator is at floor
        (move_up ?f ?nf) ; Next floor exists
    )
    :effect (and 
        ( not (elevator_at ?e ?f))
        (elevator_at ?e ?nf) ; Elevator is now at next floor
    )
)

(:action go_down
    :parameters (?e - elevator ?f - floor ?nf - floor)
    :precondition (and
        (elevator_at ?e ?f) ; Elevator is at floor
        (move_down ?f ?nf) ; Previous floor exists
    )
    :effect (and 
        ( not (elevator_at ?e ?f))
        (elevator_at ?e ?nf) ; Elevator is now at previous floor
    )
)


)

; problem
(define (problem simplified) (:domain elevators)
(:objects 
    E0 E1 - elevator
    P0 P1 - passenger
    F0 F1 F2 F3 - floor
    S0 S1 S2 - seat
)

(:init
    ; passenger 
    (passenger_at P0 F2)
    (passenger_at P1 F0)

    ; elevator
    (elevator_at E0 F0)
    (remaining_seats E0 S2)
    (available_floor E0 F0)
    (available_floor E0 F1)
    (available_floor E0 F2)

    (elevator_at E1 F2)
    (remaining_seats E1 S1)
    (available_floor E1 F2)
    (available_floor E1 F3)

    ; floor
    (move_up F0 F1)
    (move_up F1 F2)
    (move_up F2 F3)
    (move_down F1 F0)
    (move_down F2 F1)
    (move_down F3 F2)

    ; seat
    (add_seat S0 S1)
    (add_seat S1 S2)
    (remove_seat S2 S1)
    (remove_seat S1 S0)
)

(:goal (and
    (passenger_at P0 F0)
    (passenger_at P1 F3)

    ; Move up test
    ; (elevator_at E0 F3)

    ; Move down test
    ; (elevator_at E1 F0)

    ; Enter test
    ; (inside P1 E0)
))

)

; plan
1. (get_in p1 e0 s2 s1 f0)
   deleted: (passenger_at p1 f0)
   added: (inside p1 e0) (remaining_seats e0 s1)
   goals met: 0 of 2
2. (go_up e0 f0 f1)
   deleted: (elevator_at e0 f0)
   added: (elevator_at e0 f1)
   goals met: 0 of 2
3. (go_up e0 f1 f2)
   deleted: (elevator_at e0 f1)
   added: (elevator_at e0 f2)
   goals met: 0 of 2
4. (get_out p1 e0 s0 s1 f2)
   deleted: (inside p1 e0)
   added: (passenger_at p1 f2)
   goals met: 0 of 2
5. (get_in p1 e1 s1 s0 f2)
   deleted: (passenger_at p1 f2)
   added: (inside p1 e1) (remaining_seats e1 s0)
   goals met: 0 of 2
6. (get_in p0 e0 s1 s0 f2)
   deleted: (passenger_at p0 f2)
   added: (inside p0 e0) (remaining_seats e0 s0)
   goals met: 0 of 2
7. (go_up e1 f2 f3)
   deleted: (elevator_at e1 f2)
   added: (elevator_at e1 f3)
   goals met: 0 of 2
8. (go_down e0 f2 f1)
   deleted: (elevator_at e0 f2)
   added: (elevator_at e0 f1)
   goals met: 0 of 2
9. (get_out p1 e1 s0 s1 f3)
   deleted: (inside p1 e1)
   added: (passenger_at p1 f3)
   goals met: 1 of 2
10. (go_down e0 f1 f0)
   deleted: (elevator_at e0 f1)
   added: (elevator_at e0 f0)
   goals met: 1 of 2
11. (get_out p0 e0 s0 s1 f0)
   deleted: (inside p0 e0)
   added: (passenger_at p0 f0)
   goals met: 2 of 2
